IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/GPIO0_GPIO0.xml
	<register id="GPIO0_CLR_FAL_TRIG23" acronym="GPIO0_CLR_FAL_TRIG23" offset="0x58" width="32" description="">
		<bitfield id="CLRFAL3" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 3 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRFAL2" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 2 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_INTSTAT23" acronym="GPIO0_INTSTAT23" offset="0x5C" width="32" description="">
		<bitfield id="STAT3" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 2 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="STAT2" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 2 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_DIR45" acronym="GPIO0_DIR45" offset="0x60" width="32" description="">
		<bitfield id="DIR5" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 5 bits, 0 = output, 1 = input." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DIR4" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 4 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_OUT_DATA45" acronym="GPIO0_OUT_DATA45" offset="0x64" width="32" description="">
		<bitfield id="OUT5" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 5 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="OUT4" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 4 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_SET_DATA45" acronym="GPIO0_SET_DATA45" offset="0x68" width="32" description="">
		<bitfield id="SET5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 5 bits. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SET4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 4 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_DATA45" acronym="GPIO0_CLR_DATA45" offset="0x6C" width="32" description="">
		<bitfield id="CLR5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLR4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_IN_DATA45" acronym="GPIO0_IN_DATA45" offset="0x70" width="32" description="">
		<bitfield id="IN5" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 5 bits." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="IN4" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 4 bits." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO0_SET_RIS_TRIG45" acronym="GPIO0_SET_RIS_TRIG45" offset="0x74" width="32" description="">
		<bitfield id="SETRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_RIS_TRIG45" acronym="GPIO0_CLR_RIS_TRIG45" offset="0x78" width="32" description="">
		<bitfield id="CLRRIS5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRRIS4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_SET_FAL_TRIG45" acronym="GPIO0_SET_FAL_TRIG45" offset="0x7C" width="32" description="">
		<bitfield id="SETFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_FAL_TRIG45" acronym="GPIO0_CLR_FAL_TRIG45" offset="0x80" width="32" description="">
		<bitfield id="CLRFAL5" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 5 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRFAL4" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 4 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_INTSTAT45" acronym="GPIO0_INTSTAT45" offset="0x84" width="32" description="">
		<bitfield id="STAT5" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 4 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="STAT4" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 4 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
