IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/GPIO0_GPIO0.xml
	<register id="GPIO0_DIR67" acronym="GPIO0_DIR67" offset="0x88" width="32" description="">
		<bitfield id="DIR7" width="16" begin="31" end="16" resetval="0x65535" description="Direction of GPIO bank 7 bits, 0 = output, 1 = input." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="DIR6" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 6 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_OUT_DATA67" acronym="GPIO0_OUT_DATA67" offset="0x8C" width="32" description="">
		<bitfield id="OUT7" width="16" begin="31" end="16" resetval="0x0" description="Output drive state of GPIO bank 7 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="OUT6" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 6 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_SET_DATA67" acronym="GPIO0_SET_DATA67" offset="0x90" width="32" description="">
		<bitfield id="SET7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 7 bits. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SET6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 6 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_DATA67" acronym="GPIO0_CLR_DATA67" offset="0x94" width="32" description="">
		<bitfield id="CLR7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLR6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_IN_DATA67" acronym="GPIO0_IN_DATA67" offset="0x98" width="32" description="">
		<bitfield id="IN7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 7 bits." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="IN6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO0_SET_RIS_TRIG67" acronym="GPIO0_SET_RIS_TRIG67" offset="0x9C" width="32" description="">
		<bitfield id="SETRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_RIS_TRIG67" acronym="GPIO0_CLR_RIS_TRIG67" offset="0xA0" width="32" description="">
		<bitfield id="CLRRIS7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRRIS6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_SET_FAL_TRIG67" acronym="GPIO0_SET_FAL_TRIG67" offset="0xA4" width="32" description="">
		<bitfield id="SETFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="SETFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_FAL_TRIG67" acronym="GPIO0_CLR_FAL_TRIG67" offset="0xA8" width="32" description="">
		<bitfield id="CLRFAL7" width="16" begin="31" end="16" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 7 bits." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="CLRFAL6" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 6 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_INTSTAT67" acronym="GPIO0_INTSTAT67" offset="0xAC" width="32" description="">
		<bitfield id="STAT7" width="16" begin="31" end="16" resetval="0x0" description="Status of GPIO bank 6 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="31 - 16" rwaccess="RW"/> 
		<bitfield id="STAT6" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 6 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_DIR8" acronym="GPIO0_DIR8" offset="0xB0" width="32" description="">
		<bitfield id="DIR8" width="16" begin="15" end="0" resetval="0x65535" description="Direction of GPIO bank 8 bits, 0 = output, 1 = input." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_OUT_DATA8" acronym="GPIO0_OUT_DATA8" offset="0xB4" width="32" description="">
		<bitfield id="OUT8" width="16" begin="15" end="0" resetval="0x0" description="Output drive state of GPIO bank 8 bits, does not affect operation when it is configured as input. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_SET_DATA8" acronym="GPIO0_SET_DATA8" offset="0xB8" width="32" description="">
		<bitfield id="SET8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 sets the output drive state of GPIO bank 8 bits. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_DATA8" acronym="GPIO0_CLR_DATA8" offset="0xBC" width="32" description="">
		<bitfield id="CLR8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears the output drive state of GPIO. Reading it returns the output drive state." range="15 - 0" rwaccess="RW"/>
	</register>
