IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/GPIO0_GPIO0.xml
	<register id="GPIO0_IN_DATA8" acronym="GPIO0_IN_DATA8" offset="0xC0" width="32" description="">
		<bitfield id="IN8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="GPIO0_SET_RIS_TRIG8" acronym="GPIO0_SET_RIS_TRIG8" offset="0xC4" width="16" description="">
		<bitfield id="SETRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables rising edge detection for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_RIS_TRIG8" acronym="GPIO0_CLR_RIS_TRIG8" offset="0xC8" width="16" description="">
		<bitfield id="CLRRIS8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears rising edge detection for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_SET_FAL_TRIG8" acronym="GPIO0_SET_FAL_TRIG8" offset="0xCC" width="16" description="">
		<bitfield id="SETFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 enables falling edge detection for for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_CLR_FAL_TRIG8" acronym="GPIO0_CLR_FAL_TRIG8" offset="0xD0" width="16" description="">
		<bitfield id="CLRFAL8" width="16" begin="15" end="0" resetval="0x0" description="Writing 1 clears falling edge detection for for GPIO bank 8 bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="GPIO0_INTSTAT8" acronym="GPIO0_INTSTAT8" offset="0xD4" width="32" description="">
		<bitfield id="STAT8" width="16" begin="15" end="0" resetval="0x0" description="Status of GPIO bank 8 bits interrupt. Reading back 1 = interrupt occurred. 0 = interrupt hasnt occurred since last cleared. Writing 1 clears the corresponding interrupt status." range="15 - 0" rwaccess="RW"/>
	</register>
</module>